In [1]:
import pandas as pd 
import sqlite3

In [2]:
# Create the table. If mydb doesn't exist, sqlite creates it.

connection = sqlite3.connect('mydb')
cursor = connection.cursor()

In [3]:
cursor.execute('''CREATE TABLE IF NOT EXISTS movies(name VARCHAR(50) PRIMARY KEY, year INT, box_office DOUBLE, director VARCHAR(70));''')
connection.commit()

In [4]:
cursor.execute('''INSERT INTO movies values('Terminator', 1984, 78.3, 'James Cameron'), ('Predator', 1987, 98.3, 'John McTiernan'), ('Goodfellas', 1990, 47.1, 'Martin Scorcese');''')
connection.commit()

In [5]:
df = pd.read_sql_query('SELECT * FROM movies;', connection)
df

         name  year  box_office         director
0  Terminator  1984        78.3    James Cameron
1    Predator  1987        98.3   John McTiernan
2  Goodfellas  1990        47.1  Martin Scorcese